---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryZRotationSpring
source: html/79fc794c-dbde-63dc-fdce-01f0a032a07e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryZRotationSpring Property

"Z Rotation - Spring"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryZRotationSpring { get; }
```